# Завдання 3
# Простим називається число, яке ділиться націло лише на одиницю і на саме себе. Число 1 не вважається простим.
# Напишіть програму, яка знаходить усі прості числа в заданому проміжку, виводить їх на екран, а потім на вимогу
# користувача виводить їхню суму або добуток.

lst = []
a = int(input('Задайте початок промiжку: '))
b = int(input('Тепер кiнець промiжку: '))

for i in range(a, b+1):
    counter = 0
    for y in range(1, i+1):
        if i % y == 0:
            counter += 1
    if counter == 2:
        lst.append(i)
print('Всі прості числа проміжку:', lst)
r = int(input('''Хочете отримати суму простих чисел? Натисніть 1
Хочете отримати добуток простих чисел? Натисніть 2
Для виходу натисніть 3
>>>'''))

if r == 1:
    ls = 0
    for i in lst:
        ls += int(i)
    print('Сума простих чисел', ls)
elif r == 2:
    ls = 1
    for i in lst:
        ls *= int(i)
    print('Добуток простих чисел:', ls)
elif r == 3:
    print('Допобачення')
else:
    print('Помилка, спробуйте спочатку')
