# Завдання 1
# Перепишіть домашнє завдання попереднього уроку (сервіс для скорочення посилань) таким чином, щоб у нього була
# основна частина, яка відповідала би за логіку роботи та надавала узагальнений інтерфейс, і модуль представлення,
# який відповідав би за взаємодію з користувачем. При заміні останнього на інший, який взаємодіє з користувачем в
# інший спосіб, програма має продовжувати коректно працювати.

from task_1_2 import shelf, get_key, add_shelf

shelf = shelf

t = True
while t:
    r = input('''
    Додати посилання та назву? --> Введіть 'y'
    
    Хочете отримати початкове посилання? --> Напишіть коротку назву
    Хочете отримати коротку назву? --> Введіть повне посилання
    Для виходу натисніть будь що.
    >>>''')
    key = get_key(shelf, r)
    if key:
        print('Коротка назва:', key)
    elif r in shelf:
        print('Початкове посилання:', shelf[r])
    elif r.lower() == 'y':
        add_shelf(input('Введіть посилання: '), input('Введіть назву: '))
        print('Додано!')
    else:
        print('Допобачення')
        t = False
shelf.close()
