# Завдання 1
# Перепишіть домашнє завдання попереднього уроку (сервіс для скорочення посилань) таким чином, щоб у нього була
# основна частина, яка відповідала би за логіку роботи та надавала узагальнений інтерфейс, і модуль представлення,
# який відповідав би за взаємодію з користувачем. При заміні останнього на інший, який взаємодіє з користувачем в
# інший спосіб, програма має продовжувати коректно працювати.

import shelve


def add_shelf(k, v):
    shelf[k] = v


def get_key(sh, value):
    for k, v in sh.items():
        if v == value:
            return k


shelf = shelve.open('mydata')

