import operator
r = {}
d = {'Петров': {'посада': 'Сантехник', 'досвід роботи': '5', 'портфоліо': 'аврвар', 'коефіцієнт ефективності': 7, 'стек технологій': 'варвар', 'зарплатня': '5000'}, 'Пеов': {'посада': 'Сантехник', 'досвід роботи': '5', 'портфоліо': 'аврвар', 'коефіцієнт ефективності': 9, 'стек технологій': 'варвар', 'зарплатня': '5000'}}
for i in d:
    get = operator.itemgetter('коефіцієнт ефективності')
    g = get(d[i])
    r[g] = i
sorted_r = sorted(r.items())
sorted_r.sort(reverse=True)
for y in sorted_r:
    print(*y, end='\n')
