# Завдання 2
# Створіть програму, яка емулює роботу сервісу зі скорочення посилань. Повинна бути реалізована можливість введення
# початкового посилання та короткої назви і отримання початкового посилання за її назвою.

s = {}
t = True
v = input('Введіть посилання: ')
k = input('Введіть назву: ')
s[k] = v
print('Посилання та назва:', s)

while t:
    r = input('''
    Хочете отримати початкове посилання? Напишіть коротку назву
    Хочете отримати коротку назву? Введіть повне посилання
    Для виходу натисніть будь що.
    >>>''')
    if r == v:
        print('Коротка назва:', k)
    elif r == k:
        print('Початкове посилання:', v)
    else:
        print('Допобачення')
        t = False
