# Завдання 3
# Створіть програму, яка має 2 списки цілочисельних значень та друкує список унікальних значень без повтору,
# які є в 1 списку (немає в другому) і навпаки.

uniq1 = []
uniq2 = []
s1 = '22,45,3,-60,0,100,23,55,7,8,9'
s2 = '3,66,5,66,7,0,-20,-1,77,6,7,8'
lst1 = s1.split(',')
lst2 = s2.split(',')
print('Список 1:', lst1)
print('Список 2:', lst2)

for i in lst1:
    if i not in lst2:
        if i not in uniq1:
            uniq1.append(i)
for i in lst2:
    if i not in lst1:
        if i not in uniq2:
            uniq2.append(i)
print('Унікальні значення першого та другого списків в прямій послідовності:', uniq1)
print('Унікальні значення першого та другого списків в зворотній послідовності:', uniq2)
