# Завдання 6
# Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», яка повинна знаходити
# згадки про меню, спортзал, обслуговування. Якщо фідбек перевищив 60 символів, відвідувачу надається знижка
# 15% на наступне відвідування.

#feedback = input()
feedback = 'Курорт «Морська зірка» мене дуже вразив, особливо сподобалось обслуговування у номерах. На теріторїї' \
        ' курорту є спортзал. Що правда меню у ресторані бажано змініти, тут самі морепродукти, на які у мене алергія'
counter = 0

if 'меню' in feedback:
    menu = 'Відвідувач згадав про меню'
else:
    menu = 'Відвідувач не згадував про меню'
if 'спортзал' in feedback:
    sport = "Відвідувач пам'ятає про спортзал"
else:
    sport = 'Відвідувач забув про спортзал'
if 'обслуговування' in feedback:
    service = 'Відвідувач написав про обслуговування'
else:
    service = "Відвідувач не писав про обслуговування"
print(f"""Аналіз фідбеку:
{menu}
{sport}
{service}""")

for i in feedback:
    counter += 1
if counter > 60:
    print('Надати відвідувачу знижку 15% на наступне відвідування.')
else:
    print('Ніяких знижок для цього відвідувача')
