# Завдання 3
# Користувач вводить з клавіатури пропозицію. Написати функцію, яка друкуватиме на екран останні 3 символи
# кожного слова.

from re import compile

# a = 'Написати виразів виразів функцію знаходить яка за допомогою регулярних виразів текст розбиває текст на окремі ' \
#     'слова знаходить частоту окремих слів допомогою виразів'

a = input('Користувач вводить з клавіатури речення:\n>>> ')
s = []

for i in a.split():
    pattern = compile('[\w]{3}$')
    result = pattern.findall(i)
    if result:
        s.append(result[0])

print('Останні 3 символи кожного слова: ')
print(*s, sep=', ', end='.')
