# Створити функцію обчислення індексу маси тіла людини, якщо: індекс <= 18.5 - друкується 'Underweight',
# якщо <= 25.0 - 'Normal', якщо <= 30.0 - 'Overweight', інакше "Obese"


def bmi_function(a, b):
    bmi = a / (b * b)
    if 18.4 < bmi < 25.1:
        return f"Маса тіла в нормі, індекс маси тіла = {bmi}"
    elif bmi > 25:
        return f"Слідкуйте за фігурою, індекс маси тіла = {bmi}"
    else:
        return f"Недостатня вага, індекс маси тіла = {bmi}"

print(bmi_function(float(input('''Введіть масу
>>> ''')), float(input('''Введіть зріст в метрах (Наприклад 1.78)
>>> '''))))
