# Завдання 1
# Створіть програму, яка зчитує рядок, в якому знаходиться ПІБ користувача і перевіряє, чи складається
# рядок з літер, при чому кожне слово має бути записане з великої літери. Вивести результат на екран.

n = 'Кримець Олександр Михайлович '
#n = input('ПІБ:')
mistake = False

n = n.strip()
name = n.split()
for _ in name:
    if _ != _.capitalize():
        mistake = True
        break
    if _.isalpha():
        pass
    else:
        mistake = True
        break
if len(name) != 3:
    mistake = True
if mistake:
    print("Помилка, кожне слово має бути записане з великої літери, а ім'я складатися тільки з літер, там складатися з трьох слів")
else:
    m = name[0] + ' ' + name[1] + ' ' + name[2]
    print(f'Доброго вечора, {m}')
