# Завдання 1
# Дано числа a і b (a < b). Виведіть суму всіх натуральних чисел від a до b (включно).

def action():
    s = 0
    try:
        a = int(input('Перше число: '))
        b = int(input('Друге число: '))
        if a >= b:
            print('За умовою задачi, "a" повинно бути "< b". Спробуйте ще раз')
            action()
        else:
            for i in range(a, b + 1):
                s += i
            print('Сума всіх натуральних чисел:', s)
    except:
        print('Спробуйте ще раз ввести числа')
        action()
action()
