# Завдання 6
# Створіть програму авторизації, в якій користувачеві дається 3 спроби ввести свої облікові
# дані (логін та пароль). Якщо користувач за меншу кількість спроб ввів вірні дані, програма
# достроково припиняє своє виконання та виводить на екран повідомлення: «Авторизацію успішно пройдено з «№» спроби».

import time

def action():
    lo = 'login'  # правильний логiн
    p = 'password'  # та пароль
    log = False
    print('Вам дається 3 спроби, введiть свої облікові дані (логін та пароль)')
    for _ in range(1, 4):
        print(f'{_} спроба')
        login = input('Введiть Ваш логiн: ')
        password = input('Введiть пароль: ')
        if login == lo and password == p:
            print(f'Авторизацію успішно пройдено з {_} спроби')
            log = True
            break
        else:
            print('Помилка, спробуйте ще раз')
    if not log:
        print('Помилка авторизацiї, наступна спроба через 20 секунд')
        t = 20
        while t != 1:
            t -= 1
            time.sleep(1)
            print('Залишилось чекати:', t, 'секунд')
        action()
action()
