# Завдання 4
# Дано числа a і b (a < b). Виведіть на екран суму всіх натуральних чисел від a до b (включно),
# які є кратними середньому арифметичному цього проміжку.


def action():
    s = 0
    try:
        a = int(input('Перше число: '))
        b = int(input('Друге число: '))
        if a >= b:
            print('За умовою задачi, "a" повинно бути "< b". Спробуйте ще раз')
            action()
        else:
            k = (a + b) / 2
            for i in range(a, b + 1):
                if i % k == 0:
                    s += i
            if s == 0:
                print('Натуральних чисел кратних середньому арифметичному цього проміжку не має')
            else:
                print('Сума всіх натуральних чисел кратних середньому арифметичному цього проміжку:', s)
    except:
        print('Спробуйте ще раз ввести числа')
        action()
action()
