# Завдання 4
# Створіть магазин канцтоварів використовуючи списки для зберігання елементів. Для додавання елементів
# створіть функцію, яка буде запитувати дані в користувача і зібрані дані у вигляді кортежу додавати у
# створений список на початку. Результат вивести на екран. Під час створення дотримуйтесь правил специфікації PEP 8.

lis = []


def request():
    t = tuple(input('Додайте товари:\n>>> ').split())  # Олівці Крейда Лінійки Ручки Зошити Книжки
    lis.insert(0, t)
    return lis


def ret():
    print('Список товарів:', request())
    s = input('\nДодати ще натисніть 1\nВихід 2\n>>> ')
    if s == '1':
        ret()
    elif s == '2':
        print('Допобачення')
    else:
        print('Помилка, почніть з початку')


ret()
