# Завдання 2
# Є два списки, які наповнюються користувачем з клавіатури. Сформувати список, в якому будуть міститися унікальні
# значення першого відносно другого списку та навпаки без повторень. Роздрукувати підсумковий об'єкт на екран в
# прямій послідовності, зворотній, а також виконати сортування за зростанням та спаданням.

uniq = []
lst1 = list(input('Введіть значення списку, наприклад "12345xcb67891011121231425"'))
lst2 = list(input('Введіть значення списку, наприклад "5346456789dfg101146456314"'))
print('Список1:', lst1)
print('Список2:', lst2)

for i in lst1:
    if i not in lst2:
        if i not in uniq:
            uniq.append(i)
for i in lst2:
    if i not in lst1:
        if i not in uniq:
            uniq.append(i)
print('Унікальні значення першого та другого списків в прямій послідовності:', uniq)
print('Унікальні значення першого та другого списків в зворотній послідовності:', uniq[::-1])

uniq.sort()
print('Сортування за зростанням:', uniq)
uniq.sort(reverse=True)
print('Сортування за спаданням:', uniq)
