# Завдання 4
# Створіть список, введіть кількість його елементів і самі значення. Передбачити меню, в якому: після натискання
# клавіші 1 ці значення виведуться на екран у зворотному порядку, а після натискання клавіші 2 – за зростанням.

n = int(input('Введіть кількість елементів списку: '))
b = 0
lst = []
while b != n:
    b += 1
    t = input('Введiть значення: ')
    lst.append(t)
print('Ваш список:', lst)
ls = sorted(lst)

r = int(input('''Вивести значення на екран у зворотному порядку, натисніть 1
Вивести значення на екран за зростанням, натисніть 2
Для виходу натисніть 3
>>>'''))

if r == 1:
    print('Значення у зворотному порядку', lst[::-1])
elif r == 2:
    print('Значення за зростанням:', ls)
elif r == 3:
    print('Допобачення')
else:
    print('Помилка, спробуйте спочатку')
