# Завдання 3
# Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0 за формулами 𝑥1,2 = (−𝑏±𝑏2−4𝑎𝑐‾‾‾‾‾‾‾‾√)/2𝑎 .
# Значення a, b та c вводяться з клавіатури. Для знаходження кореня використовуйте оператор зведення в ступінь, а не
# функцію math.sqrt, щоб отримати комплексні числа у випадку, якщо вираз під коренем негативний.

a, b, c = float(input()), float(input()), float(input())
x1 = (-b - (b**2 - 4*a*c)**0.5) / (2 * a)
x2 = (-b + (b**2 - 4*a*c)**0.5) / (2 * a)
print(x1, x2)
