# Завдання 5
# Створіть програму спортивного комплексу, у якій передбачене меню: 1 - перелік видів спорту, 2 - команда тренерів,
# 3 - розклад тренувань, 4 - вартість тренування. Дані зберігати у словниках. Також передбачити пошук по прізвищу
# тренера, яке вводиться з клавіатури у відповідному пункті меню. Якщо ключ не буде знайдений, створити відповідний
# клас-Exception, який буде викликатися в обробнику виключень.

class TrainerException(Exception):
    def __init__(self, text):
        self.text = text


# Створюємо списки працівників
sports = {1: 'Футбол', 2: 'Фігурне катання', 3: 'Фехтування', 4: 'Бокс', 5: 'Плавання'}
trainers = {'Шевченко': 'Футбол', 'Чумак': 'Фехтування', 'Мельник': 'Бокс', 'Бакало': 'Плавання',
            'Андрусенко': 'Фігурне катання'}
training_schedule = {'Понеділок': 'Футбол, Фехтування', 'Вівторок': 'Бокс, Плавання', 'Середа': 'Футбол, Фехтування',
                     'Четвер': 'Бокс, Плавання', 'П\'ятниця': 'Футбол, Фехтування', 'Субота': 'Бокс, Плавання',
                     'Неділя': 'Фігурне катання'}
training_cost = {'Футбол': 5000, 'Фігурне катання': 1000, 'Фехтування': 5500, 'Бокс': 4000, 'Плавання': 6000}


def action():
    try:
        d = int(input('''
Оберiть дiю (число):
1. Види спорту
2. Тренери
3. Розклад
4. Вартість
5. Пошук тренера *NEW*
6. Вийти
>>> '''))
        if d == 1:  # 1. Види спорту
            print('\nПерелік видів спорту:')
            for key, value in sports.items():
                print(key, value)
                print('-' * 10)
            action()
        elif d == 2:  # 2. Тренери
            print('\nНаші тренери:')
            for key, value in trainers.items():
                print(key, value)
                print('-' * 10)
            action()
        elif d == 3:  # 3. Розклад
            print('\nРозклад тренувань:')
            for key, value in training_schedule.items():
                print(key, value)
                print('-' * 10)
            action()
        elif d == 4:  # 4. Вартість
            print('\nРозклад тренувань:')
            for key, value in training_cost.items():
                print(key, value)
                print('-' * 10)
            action()
        elif d == 5:  # 5. Пошук тренера
            try:
                t = input('Введіть прізвище тренера\n>>> ')
                tr = trainers.get(t)
                if not tr:
                    raise TrainerException('Трапилась помилка, такий тренер в нас не працює')
                else:
                    print('Вітаю, цей тренер викладає', tr)
            except TrainerException as e:
                print(e)
            action()
        elif d == 6:  # 6. Вийти
            print('Завершення програми')
        else:
            print('Потрiбно обрати дiю (1-5), спробуйте ще раз')
            action()
    except Exception as e:
        print(f'Помилка вводу "{e}", почнiть з початку')
        action()


action()
