# Завдання 6
# Написати програму визначення днів тижня. Дані про день тижня вводяться користувачем з
# клавіатури. Якщо будній день - виводити на екран повідомлення "Сьогодні на роботу", у
# вихідні дні - "Сьогодні вихідний", в інших випадках - "Такого дня не існує".

weekdays = "Понеділок, Вівторок, Середа, Четвер, П'ятниця"
weekends = "Субота, Неділя"

day = input('Введiть день тижня: ')

if day.upper() in weekdays.upper():
    print('Сьогодні на роботу')
elif day.upper() in weekends.upper():
    print('Сьогодні вихідний')
else:
    print('Такого дня не існує')
