# Завдання 4
#  Напишіть програму-калькулятор, в якій користувач зможе обрати операцію, ввести необхідні
#  числа та отримати результат. Операції, які необхідно реалізувати: додавання, віднімання,
#  множення, ділення, зведення в ступінь, квадратний корінь, кубічний корінь, синус, косинус
#  та тангенс числа.

import math


def action():
    try:
        d = int(input('''Вiтаю, оберiть дiю (число):
1. Додавання
2. Віднімання
3. Множення
4. Ділення
5. Зведення в ступінь
6. Квадратний корінь
7. Кубічний корінь
8. Знайти синус
9. Знайти косинус
10. Знайти тангенс
= '''))
        if d == 1:  # 1. Додавання
            x = float(input('Введiть перше число: '))
            y = float(input('Введiть друге число: '))
            print('Результат =', x + y)
            print('Завершення програми')
        elif d == 2:  # 2. Віднімання
            x = float(input('Введiть перше число: '))
            y = float(input('Введiть друге число: '))
            print('Результат =', x - y)
            print('Завершення програми')
        elif d == 3:  # 3. Множення
            x = float(input('Введiть перше число: '))
            y = float(input('Введiть друге число: '))
            print('Результат =', x * y)
            print('Завершення програми')
        elif d == 4:  # 4. Ділення
            x = float(input('Введiть перше число: '))
            y = float(input('Введiть друге число: '))
            print('Результат =', x / y)
            print('Завершення програми')
        elif d == 5:  # 5. Зведення в ступінь
            x = float(input('Введiть число: '))
            y = float(input('Введiть ступінь: '))
            print('Результат =', pow(x, y))
            print('Завершення програми')
        elif d == 6:  # 6. Квадратний корінь
            x = float(input('Введiть число: '))
            print('Результат =', math.sqrt(x))
            print('Завершення програми')
        elif d == 7:  # 7. Кубічний корінь
            x = float(input('Введiть число: '))
            print('Результат =', x ** (1 / 3))
            print('Завершення програми')
        elif d == 8:  # 8. Знайти синус
            x = float(input('Введiть число: '))
            print('Результат =', math.sin(x))
            print('Завершення програми')
        elif d == 9:  # 9. Знайти косинус
            x = float(input('Введiть число: '))
            print('Результат =', math.cos(x))
            print('Завершення програми')
        elif d == 10:  # 10. Знайти тангенс
            x = float(input('Введiть число: '))
            print('Результат =', math.tan(x))
            print('Завершення програми')
        else:
            print('Потрiбно обрати дiю (1-10), спробуйте ще раз')
            action()
    except:
        print('Помилка вводу, почнiть з початку')
        action()
action()